ENTER_HEXAGONS = '\nПожалуйста, введите желаемое количество шестиугольников: '
MUST_BE_4_TO_20 = 'Оно должно быть от 4 до 20.'
ENTER_NUMBER = 'Введите число'
CHOOSE_MODE = '\nВведите число ' \
'1 - выбрать цвета случайно, ' \
'2 - выбрать цвета из списка самостоятельно: '
RANDOM_CHOSEN = 'Случайно выбраны цвета: '
AVAILABLE_COLORS = 'Доступные цвета заливки:'
CHOOSE = '\nВыберите'
FILL_COLOR = '-й цвет заливки: '
INVALID_VALUE = 'не является верным значением'
ENTER_1_OR_2 = 'Пожалуйста, введите 1 или 2'
DRAW = '\nСоздаю красоту...'
