# local random events
#
DOWNFALL = 'Произошёл обвал на станции!'
BUILDING_MATERIALS = 'Ваши люди нашли запасы строительных материалов'
ARMAMENT = 'В близлежащем тоннеле были обнаружены ' \
                            'оружие и обмундирование'
MUTANT_ATTACK = 'На станцию напали мутанты!'
REBEL = 'На станции произошёл бунт!'
OUTER_RESIDENTS = 'К вам присоединились жители с ближайших тоннелей'
BANDITS_ATTACK = 'На станцию напали бандиты!'
FLOOD = 'Станцию затопило!'
KNIFING = 'На станции произошла поножовщина!'
DESERTER = 'Отряд военных дезертировал и забрал с собой оружие!'
EPIDEMY = 'На станции началась эпидемия!'
LEAN_YEAR = 'Этот год неурожайный, провианта на всех не хватает!'
UNFAMILIAR_ROOM = 'Вы нашли ранее неизвестную комнату'\
                ' на станции, в которой оказались большие запасы ресурсов!'
STRANGE_SIGNAL = 'Ваша радиостанция уловила странный сигнал!'\
                ' Значит ли это, что не только Вы остались в живых?...'
MISSING_SQUAD = 'Отряд военных отправился на поиски ресурсов'\
                ' в тоннель, однако спустя 3 дня они так и не вернулись.'
PEOPLE_GOOD_INTENTIONS = 'На вашу станцию пришли люди с оружием, но'\
                ' злых намерений у них нет, им просто нужно убежище.'
WEEPING = 'Уже вторую неделю из тоннелей раздается плач'\
                ' ребенка. Все, кто пытался узнать, что является'\
                ' источником звука, так и не вернулись на станцию.'

# battle random events
#
DOWNFALL_BATTLE = 'Произошёл обвал в тоннеле'
TROPHY_ARMAMENT = 'Во время битвы вы получили трофейные'\
                  ' боеприпасы и оружие'
IRRADIATION = 'Ваши бойцы получили сильное облучение'\
                  ' и они теперь не боеспособны'
ANOMALY = 'Когда ваши люди возвращались с битвы,'\
                  ' они наткнулись на аномалию.'\
                  ' Лишь часть из них вернулась в живых'
MUTANT_ATTACK_BATTLE = 'В момент атаки на ваших людей напала стая мутантов'
ARMORED_TRAIN = 'В тоннелях метро вы нашли брошенный бронепоезд,'\
                  ' чей же он может быть?'
CRATES_OF_SUPPLIES = 'Вы обнаружили ящики с припасами на базе бандитов'
'Возвращаясь с миссии вы обнаружили скрытое поселение,'\
                  ' его люди присоединяются к вам'

# expedition random events
#
